<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"c780bde62d65a636fe62cbdfc2ec40b974205c818ede0cc6100f88938ca930e4","plan_job_ref":"Job Create terraform plan #32 at https://github.com/coforma/co-boomi-atom-fargate/actions/runs/6936795927","plan_hash":"45374fe5889bac8caa222335a3f6474f0240dce26b0815c9ce3e8be09ef982c0","plan_text_format":"text","version":"1.37.0"} -->
Terraform plan in __.__
<details>
<summary>Plan: 3 to add, 1 to change, 2 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/455525ad8259822709ca1708a36d606915bdcfbd75527add761d99730707de0f.zip" -> "builds/1d279ad44b18c4908a34a9cd1a1e3e35d1ec116652fc11f5eb43c078fe53d881.zip"
        id                             = "co-boomi-atom-secret-install-lambda"
      ~ last_modified                  = "2023-11-18T03:57:27.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:950012193416:function:co-boomi-atom-secret-install-lambda:19" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:950012193416:function:co-boomi-atom-secret-install-lambda:19/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "19" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_permission.current_version_triggers["secrets"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "*******" -> (known after apply)
      ~ qualifier           = "19" # forces replacement -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + "./lambda/rotate_install_token.py",
                      + null,
                    ],
                  + [
                      + "zip",
                      + "./lambda/package/",
                      + null,
                    ],
                ]
              + filename      = "builds/1d279ad44b18c4908a34a9cd1a1e3e35d1ec116652fc11f5eb43c078fe53d881.zip"
              + runtime       = "python3.11"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/1d279ad44b18c4908a34a9cd1a1e3e35d1ec116652fc11f5eb43c078fe53d881.plan.json"
      + id                   = (known after apply)
    }

  # module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "*******************" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/455525ad8259822709ca1708a36d606915bdcfbd75527add761d99730707de0f.zip" -> "builds/1d279ad44b18c4908a34a9cd1a1e3e35d1ec116652fc11f5eb43c078fe53d881.zip"
          ~ "timestamp" = "1700279836242595000" -> "1700521203698856200"
        }
    }

Plan: 3 to add, 1 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #32](https://github.com/coforma/co-boomi-atom-fargate/actions/runs/6936795927)